{"id": 0, "text": "nmenon: oh wow... #gsoc!", "source": "#gsoc"}
{"id": 1, "text": "ayush1325: @Nishanth Menon Do you use the standard beagleplay config when buidling mainline? Do I need to copy the `firmware` from ti kernel?", "source": "#gsoc"}
{"id": 2, "text": "nmenon: i only use upstream defconfig", "source": "#gsoc"}
{"id": 3, "text": "nmenon: if there are patches missing in defconfig in upstream, I post it there", "source": "#gsoc"}
{"id": 4, "text": "nmenon: why do you need firmware? you are working on kernel. everything about firmware comes from beagle's build", "source": "#gsoc"}
{"id": 5, "text": "nmenon: I think robert even releases an upstream based disk image if you want to play around (I dont use it though. i just use the standard beagle images and replace the kernel", "source": "#gsoc"}
{"id": 6, "text": "ayush1325: I remember it complaining at me when I was using config from beagleplay /boot/config.", "source": "#gsoc"}
{"id": 7, "text": "nmenon: we dont use beagle's config in upstream 😉 - the only big thing that is missing is containers - beagle customizes to enable docker - upstream is independent of a specific container tech..", "source": "#gsoc"}
{"id": 8, "text": "ayush1325: @Nishanth Menon I have created a work branch (https://github.com/Ayush1325/linux/tree/gb-beagleplay). booted into the kernel. but I am getting `Got Unknown Frame 65`  when loading the driver, which probably means the UART i am connected to is not the correct one.", "source": "#gsoc"}
{"id": 9, "text": "ayush1325: Ok, so it seems the driver is actually working. It's just that the upstream greybus cannot parse the manifest that bcf sends. I guess it is due to the extensions to manifest made for mikrobus. But the svc interactions work.", "source": "#gsoc"}
{"id": 10, "text": "nmenon: first levels of comments https://github.com/Ayush1325/linux/commits/gb-beagleplay\n1. subject line: follow the convention of the files being touched - do git log --oneline file_name to see convention\n2. commit message should have more detailed commit message to explain to the reviewer why the change is needed etc.. \n3. the sequence of patches should be:\nDevice tree binding yaml binding\ndriver changes\ndts update", "source": "#gsoc"}
{"id": 11, "text": "nmenon: https://github.com/Ayush1325/linux/commit/d4ebd7c0aacb5db2a5827eea1ddbc95894cdf87e should be rolled up with the driver patch", "source": "#gsoc"}
{"id": 12, "text": "nmenon: I doubt https://github.com/Ayush1325/linux/commit/8b9326ec614d3d1ce6a2369b376b565aca66b8d7 is going to fly upstream. Device tree must describe hardware.", "source": "#gsoc"}
{"id": 13, "text": "ayush1325: The name should be descriptive or should it not be added to the device tree? I picked it up from ti kernel device tree.", "source": "#gsoc"}
{"id": 14, "text": "nmenon: https://www.youtube.com/watch?v=JrwZ4xLBU38&list=PLbzoR-pLrL6pY8a8zSKRC6-AihFrruOkq&index=15 watch this video", "source": "#gsoc"}
{"id": 15, "text": "nmenon: https://github.com/Ayush1325/linux/commit/237b8f449dd85bd821f4fd1f136720269743a251#diff-8dba146cc2d0e7c65771c9ce939c75b9dc568361253e8e0837b525eb50848355R5 -> You need to add Copyright (C) 2023  BeagleBoard.org Foundation -> @rcn-ee / @JKridner  comment on exact beagleboard.org foundation license to add", "source": "#gsoc"}
{"id": 16, "text": "nmenon: https://github.com/Ayush1325/linux/commit/237b8f449dd85bd821f4fd1f136720269743a251#diff-8dba146cc2d0e7c65771c9ce939c75b9dc568361253e8e0837b525eb50848355R242 no C++ comments in code", "source": "#gsoc"}
{"id": 17, "text": "nmenon: TI tree does'nt support mikrobus 😉 - it was probably picked up from beagle kernel 🙂", "source": "#gsoc"}
{"id": 18, "text": "nmenon: https://gist.github.com/nmenon/bf15fc8c5df7d3380a71454e9ad37b58 -> output of kpv -C -V -L -n 3", "source": "#gsoc"}
{"id": 19, "text": "nmenon: all the patches should pass the standard static checkers which is what kernel_patch_verify runs.. so your series is not ready for submission upstream 😦", "source": "#gsoc"}
{"id": 20, "text": "nmenon: since you are working with linux-next https://gist.github.com/nmenon/bf15fc8c5df7d3380a71454e9ad37b58#file-kpv-c-v-l-n-3-L184 -> warnings that is coming in from other files, I'd ignore", "source": "#gsoc"}
{"id": 21, "text": "ayush1325: Yes. I was fixing those one by one after having run them locally. I will push to the branch once they are fixed.", "source": "#gsoc"}
{"id": 22, "text": "nmenon: ok, good.", "source": "#gsoc"}
{"id": 23, "text": "ayush1325: I was more concerned about the fact that without mikrobus in upstream, the driver cannot be used with any actual bcf node.", "source": "#gsoc"}
{"id": 24, "text": "nmenon: That  is how we build a system up -> this needs to be clearly explained to folks what are these changes meant to bring in and why. how we are building the stack up. this is foundational layer.", "source": "#gsoc"}
{"id": 25, "text": "nmenon: So, cover-letter and commit message of the patch will need to be descriptive enough to explain. device tree binding has to be rather very strong to get past Rob/Krystoff/Connor", "source": "#gsoc"}
{"id": 26, "text": "ayush1325: Yeah, I definitely need to add that. I didn't think mikrobus would be needed if I am not actually using mikrobus.", "source": "#gsoc"}
{"id": 27, "text": "nmenon: yeah - keep in mind that the people who  will review have no idea what beagleplay is. or  cc1352 is. unless they are convinced this is benefitting large userbase, it is a tough sell -> it is branded narrowly as beagleplay greybus extension.. which makes it harder to accept", "source": "#gsoc"}
{"id": 28, "text": "ayush1325: Hmm. I have actually considered branding it as a generic greybus extension when we have SVC in a different co-processor with UART between them. The only device I currently know of which falls in this is beagleplay though.", "source": "#gsoc"}
{"id": 29, "text": "ayush1325: The SVC running code simply needs to be connected with UART, not even be in the same pcb if you really want to stretch it.", "source": "#gsoc"}
{"id": 30, "text": "nmenon: you have to sell it's potential to a wider base than beagleplay - that is key. and have documentation to explain how people can use it beyond beagleplay. that makes it more interesting to folks to review and accept.", "source": "#gsoc"}
{"id": 31, "text": "ayush1325: Thanks. Will definitely look into that.", "source": "#gsoc"}
{"id": 32, "text": "nmenon: i am not entirely sure where the staging drivers' device tree bindings go.. hmm..", "source": "#gsoc"}
{"id": 33, "text": "nmenon: funny to see greybus sitting in staging area after all these years!", "source": "#gsoc"}
{"id": 34, "text": "nmenon: given an option, i might have extended actual non-staging virtio framework instead..", "source": "#gsoc"}
{"id": 35, "text": "nmenon: sorry, did'nt mean to diminish your work.. just thinking aloud.. looking at this  for the first time.", "source": "#gsoc"}
{"id": 36, "text": "ayush1325: Sure. What did you mean by extending virtio framework? It seems interesting.", "source": "#gsoc"}
{"id": 37, "text": "nmenon: but yeah - in the cover-letter it will need to explain why existing virtio or other similar frameworks were not chosen and why grey-bus was the logical answer..", "source": "#gsoc"}
{"id": 38, "text": "nmenon: https://www.kernel.org/doc/html/next/driver-api/virtio/virtio.html", "source": "#gsoc"}
{"id": 39, "text": "nmenon: anyways, thanks for putting the branch together.. it is much easier to see what is going on.. i gotta go now, kids are waking up.. gotta feed the little monsters 😉", "source": "#gsoc"}
{"id": 40, "text": "ayush1325: Sure. Thanks for all your help. Will keep working on this in my free time.", "source": "#gsoc"}
{"id": 41, "text": "nmenon: np", "source": "#gsoc"}
{"id": 42, "text": "ayush1325: @Nishanth Menon I have tried writing a dt schema: https://github.com/Ayush1325/linux/commit/b8ef3d190256623426dd7913cb8d9c636bd14992. It doesn't seem to throw any eroros on running `make dt_binding_check DT_SCHEMA_FILES=beaglecc1352.yaml -j12` but well, I have no idea if it is what is expected.", "source": "#gsoc"}
{"id": 43, "text": "ayush1325: ```\nsubject line: follow the convention of the files being touched - do git log --oneline file_name to see convention\n```\nWhich commit are you referring to? The gb-beagleplay commit touches the Makefile, KConfig and gb-beagleplay. Should it instead say `greybus: gb-beagleplay:`?", "source": "#gsoc"}
{"id": 44, "text": "nmenon: Did u run kpv? It takes care of the checks. Directory path looks wrong", "source": "#gsoc"}
{"id": 45, "text": "nmenon: Compatible. You just have one item. So just const: beagle, cc1352", "source": "#gsoc"}
{"id": 46, "text": "nmenon: Also add an example dts to show. The main fight here is to explain why is this hardware definition", "source": "#gsoc"}
{"id": 47, "text": "nmenon: As I said I want cc'ed on patches themselves, so wasn't able to give exact comments. But if you did do what I said on the files, you should see the pattern. The dts patch for example was definitely wrong.", "source": "#gsoc"}
{"id": 48, "text": "ayush1325: It should not go under `serial`?", "source": "#gsoc"}
{"id": 49, "text": "ayush1325: @Nishanth Menon Also, should I really cc lkml on all the patches even though I am sending to greybus mailing list and Ccing device tree ml?", "source": "#gsoc"}
{"id": 50, "text": "nmenon: Yes", "source": "#gsoc"}
{"id": 51, "text": "nmenon: scripts/get_maintainers.pl will tell u the same thing", "source": "#gsoc"}
{"id": 52, "text": "ayush1325: @Nishanth Menon I think `s/dev_warn/dev_warn_ratelimited` means substituting (at least in vimspeak)?", "source": "#gsoc"}
{"id": 53, "text": "nmenon: yup", "source": "#gsoc"}
{"id": 54, "text": "ayush1325: Ok. I thought the ratelimit comment was about general ratelimiting and not logging.", "source": "#gsoc"}
{"id": 55, "text": "nmenon: his comment specifically was on dev_warn", "source": "#gsoc"}
{"id": 56, "text": "ayush1325: Yeah. My mistake. I was't really aware about the ratelimited versions of logging to it never crossed my mind.", "source": "#gsoc"}
{"id": 57, "text": "nmenon: I think the most troublesome one is https://lore.kernel.org/all/937ea540-09e1-65f2-7165-662bbee2542b@kernel.org/", "source": "#gsoc"}
{"id": 58, "text": "nmenon: I dont see any other greybus bindings in Documentation/device-tree/ ... so makes this a big challenge", "source": "#gsoc"}
{"id": 59, "text": "ayush1325: Does a binding which resides in childnode (beaglecc1352 in our case) need to define the properties of the main device or parent (main_uart6)?", "source": "#gsoc"}
{"id": 60, "text": "ayush1325: Are there maybe any bindings that just introduce a compatible string and nothing more? Maybe that would be a good place to start? \nGreybus is now in stable, so it should at least be possible to add greybus bindings, if a bit hard", "source": "#gsoc"}
{"id": 61, "text": "nmenon: no - wl1807 binding is it's own yaml file.\n\nWhat we could claim is 1352 as a binding..", "source": "#gsoc"}
{"id": 62, "text": "nmenon: so greybus is just the bus protocol it uses, but the main thing is dt describes how 1352 device integrates. NOTE: this might conflict with other approaches..", "source": "#gsoc"}
{"id": 63, "text": "ayush1325: Yes, it does seem like claiming it 1352 binding might end up being what needs to be done. I would still ask around in the patch thread to see if there are any better approaches.", "source": "#gsoc"}
{"id": 64, "text": "jkridner: I'm moving the ideas page for next year... help reviewing and editing appreciated: https://bbb.io/gsocideas", "source": "#gsoc"}
{"id": 65, "text": "harshit6383: I want to contribute to gsoc can anyone suggest a good repo in beagle board before proposing any idea my language is javascript.", "source": "#gsoc"}
{"id": 66, "text": "harshit6383: Sorry if this question is very basic.", "source": "#gsoc"}
{"id": 67, "text": "harshit6383: Actually I was able to find project ideas but I need to submit some initial PRs before giving gsoc proposal for which I need to find initial repository to contribute.", "source": "#gsoc"}
{"id": 68, "text": "rcnee: Fun opps on mainline (6.6-rc1) ```[   12.687223] gb_beagleplay serial0-0: Using baudrate 115200```", "source": "#gsoc"}
{"id": 69, "text": "rcnee: https://git.beagleboard.org/RobertCNelson/arm64-multiplatform/-/tree/v6.6.x-arm64-k3/patches/gb-beagleplay might be behind...", "source": "#gsoc"}
{"id": 70, "text": "ayush1325: Hmm. The patch 3 seems to be missing: https://github.com/Ayush1325/linux/commit/63fe6da2be2472133565de8f23ef92d710eb5d84. I also have more NULL checks since that patch. I will check out if I can reproduce it on my local tree.", "source": "#gsoc"}
{"id": 71, "text": "rcnee: Oh patch 3 got moved into the DT changes repo..", "source": "#gsoc"}
{"id": 72, "text": "ayush1325: Yeah. It will stay on 3 patches from now (as far as I can tell).", "source": "#gsoc"}
{"id": 73, "text": "rcnee: https://git.beagleboard.org/beagleboard/BeagleBoard-DeviceTrees/-/blob/v6.6.x/src/arm64/k3-am625-beagleplay.dts", "source": "#gsoc"}
{"id": 74, "text": "rcnee: I had other DT changes, it was easier the changing patch 3 again and again", "source": "#gsoc"}
{"id": 75, "text": "ayush1325: Sure. the mainline and beagle kernel dt are different so I am not sure if you could directly apply the patch anyway. Although the dt name will change again from all the feedback I have got.", "source": "#gsoc"}
{"id": 76, "text": "ayush1325: So how much of CC1352 do I need to describe in dtbindings? The Kernel docs say you should describe the complete device so I guess I should use the complete binding from zephyr/dts (modified for linux since the zephyr dt schema seems quite different), and define cc1352 as an soc. \nAlso should it be `ti,cc1352` or `beagle,cc1352`?", "source": "#gsoc"}
{"id": 77, "text": "ayush1325: @JKridner @Nishanth Menon As outlined in the mailing list by Jason (https://lists.linaro.org/archives/list/greybus-dev@lists.linaro.org/message/ZLH5INCQPV3YEYMVCW4V2R5CDMHFQOOA/), I think branding it as BeagleConnect would be a good option. \nThis would mean having bindings in `Documentation/devicetree/bindings/firmware/beagle,beagleconnect.yaml` and allow future additions as BeagleConnect instead of being tied to beagleplay. The driver can be renamed as `gb-beagleconnect`.", "source": "#gsoc"}
{"id": 78, "text": "nmenon: dt bindings needs to be hardware", "source": "#gsoc"}
{"id": 79, "text": "ayush1325: The dt bindings under `Documentation/devicetree/bindings/firmware/` seem to be more related to firmware running on top of soc than the device itself. Like `amlogic,meson-gxbb-sm.yaml` seems to be used to identify `Amlogic Secure Monitor (SM)` and has a single required compatibilty or `nvidia,tegra186-bpmp.yaml` for BPMP processor in nvidia gpus.\nWe can describe cc1352 as the beagleconnect or svc processor in case of beagleplay device rather than any generic cc1352.", "source": "#gsoc"}
{"id": 80, "text": "nmenon: https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/tree/arch/arm64/boot/dts/nvidia/tegra194.dtsi#n1723 for example is tied to a specific hardware", "source": "#gsoc"}
{"id": 81, "text": "nmenon: you need to describe the hardware and then properties or subnodes (such as links) OR you will need to go via actual h/w call path - such as smc (secure monitor call) https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/tree/arch/arm64/boot/dts/freescale/imx8ulp.dtsi#n169", "source": "#gsoc"}
{"id": 82, "text": "nmenon: simplest will be to link it as cc1352 and then extend the description as a link property", "source": "#gsoc"}
{"id": 83, "text": "nmenon: it will fly better with the maintainers as \"generic\" devices are strictly frowned upon", "source": "#gsoc"}
{"id": 84, "text": "ayush1325: What is a link property? Do you mean `links` which seems to allow pointing to a label? I guess what you are suggesting is something like the following:\n```dts\n&main_uart6 {\n  links = <&cc1352_uart>;\n  ...\n}\n\n&cc1352 {\n   cc1352_uart {\n     compatibile = \"something\";\n   }\n  ...\n}\n```", "source": "#gsoc"}
{"id": 85, "text": "nmenon: PHandle, not literally links property", "source": "#gsoc"}
{"id": 86, "text": "ayush1325: @Nishanth Menon Should I place cc1352 bindings under `soc/ti`? or maybe create a new folder for `beagle`?", "source": "#gsoc"}
{"id": 87, "text": "nmenon: typically we dont. soc/ti are for description of the entire SoC. wllink power ICs etc go their specific folders", "source": "#gsoc"}
{"id": 88, "text": "ayush1325: Hmm. Won't we have to categorize CC1352 as an SoC? Although I guess categorizing it as SoC would mean having to describe the complete hardware (even the parts not being used) according to docs.", "source": "#gsoc"}
{"id": 89, "text": "ayush1325: @Nishanth Menon What resources would need to be added to the dt bindings?  Krzysztof mentioned this: \"By resources I mean whatever is needed to power it up and operate, e.g. clocks, supplies, reset lines.\". But well, I am not sure if anything other than compatible is needed for cc1352p7 as an mcu", "source": "#gsoc"}
{"id": 90, "text": "ayush1325: Also, it was suggested to use `ti,cc1352p7` as the device name. Since this is not a full SoC (I think?), it should probably go into `arm` There is a `arm/ti` folder as well so should it be put there?", "source": "#gsoc"}
{"id": 91, "text": "nmenon: You will need things like reset lines etc.", "source": "#gsoc"}
{"id": 92, "text": "nmenon: I thought I explained previously", "source": "#gsoc"}
{"id": 93, "text": "ayush1325: Reset lines refers to RESET_IN in data sheet right?", "source": "#gsoc"}
{"id": 94, "text": "nmenon: Yes. There will be clocks etc", "source": "#gsoc"}
{"id": 95, "text": "nmenon: Look at a peripheral on uart as an example", "source": "#gsoc"}
{"id": 96, "text": "ayush1325: You mentioned that they go to their specific folders, but well, I am not sure if `cc1352p7` is a net mcu or a generic arm mcu. And there are other `cc1352p*` and `cc1352r*`, so not sure if that changes anything.", "source": "#gsoc"}
{"id": 97, "text": "nmenon: You need to look at it as a peripheral, not a processor view", "source": "#gsoc"}
{"id": 98, "text": "nmenon: think that cc1352p7 is not programmable. it is a ROMed peripheral", "source": "#gsoc"}
{"id": 99, "text": "nmenon: now, what does cc1352p7 need to talk to SoC from SoC's perspective - remember the description is agnostic of beagleplay. even iMX8 should be able to interface with it", "source": "#gsoc"}
{"id": 100, "text": "nmenon: it has a clock, reset lines, may be power supplies..", "source": "#gsoc"}
{"id": 101, "text": "nmenon: you would start from https://www.ti.com/product/CC1352P7", "source": "#gsoc"}
{"id": 102, "text": "ayush1325: Thanks, will start there", "source": "#gsoc"}
{"id": 103, "text": "nmenon: supplies, reset, osc clock - correct?", "source": "#gsoc"}
{"id": 104, "text": "nmenon: DT is hardware description -> so using Documentation/devicetree/bindings/net/wireless/ti,wlcore.yaml as an example..", "source": "#gsoc"}
{"id": 105, "text": "nmenon: See these examples: https://www.kernel.org/doc/Documentation/devicetree/bindings/net/wireless/ti%2Cwlcore.yaml - it can interface with mmc, spi among other options..", "source": "#gsoc"}
{"id": 106, "text": "nmenon: Rather curious case here though - if cc1352p7 is a peripheral - it has a different dt view compared to zephyr trying to describe cc1352p7 in device tree, where it is the processor view!", "source": "#gsoc"}
{"id": 107, "text": "ayush1325: @Nishanth Menon I have added `reset-gpios` and `vdds-supply` (https://github.com/Ayush1325/linux/blob/f131506ea930b12f8794b168f580c8dbe99780f9/arch/arm64/boot/dts/ti/k3-am625-beagleplay.dts#L874). I referred to design docs (https://docs.beagleboard.org/latest/boards/beagleplay/03-design.html) for connections. Should I send a new patch or wait for feedback on `gb-beagleplay` driver?", "source": "#gsoc"}
{"id": 108, "text": "nmenon: I am out on vacation this week. I can respond next week.", "source": "#gsoc"}
{"id": 109, "text": "ayush1325: Sure, no problem.", "source": "#gsoc"}
{"id": 110, "text": "vaibhav210603: Hello, I am Vaibhav\nI am new to open source and seeking for a guidance/mentorship to contribute here.\nI have been working on Js for a while now and currently learning react.js\nwould be really glad and grateful for a response", "source": "#gsoc"}
{"id": 111, "text": "somismyuserid: hi", "source": "#gsoc"}
{"id": 112, "text": "somismyuserid: how can i start contributing ??", "source": "#gsoc"}
{"id": 113, "text": "jkridner: https://forum.beagleboard.org/t/gsoc-ideas/35850", "source": "#gsoc"}
{"id": 114, "text": "jkridner: I need this updated for 2024!!", "source": "#gsoc"}
{"id": 115, "text": "jkridner: _waves to @av500_", "source": "#gsoc"}
{"id": 116, "text": "melta101: can we provide any ideas or are they exclusive to specific people?", "source": "#gsoc"}
{"id": 117, "text": "av500: waves to @JKridner", "source": "#gsoc"}
{"id": 118, "text": "jkridner: hi @av500 !!!!", "source": "#gsoc"}
{"id": 119, "text": "jkridner: @melta101 idea away!", "source": "#gsoc"}
{"id": 120, "text": "melta101: i was thinking of implementing a library to access cpufreq  so it will be easier for other dev to create solution tailored to the required compute power efficiently", "source": "#gsoc"}
{"id": 121, "text": "nmenon: Why override kernel governor? please dont introduce systemd into this world.. 😦 oh no..... rather if governors of cpufreq can be made better it helps everyone.. unless you are thinking some sort of extension of powertop or the like..", "source": "#gsoc"}
{"id": 122, "text": "melta101: yea, something like an extension of powertop", "source": "#gsoc"}
{"id": 123, "text": "melta101: ah also, one thing which i wanted to do was design a HMI cape, makes it less problematic, carrying a laptop for it", "source": "#gsoc"}
{"id": 124, "text": "melta101: so designing a lib for it,along the line...", "source": "#gsoc"}
{"id": 125, "text": "dhruvag2000: Beagleboard mentors meetup in Mumbai 😃\nHad a great time over some slices of pizza and got to see some great fellow mentors and students in person!", "source": "#gsoc"}
{"id": 126, "text": "jkridner: Time to get started with GSoC. Interested? Contact me. Share your project ideas at https://bbb.io/gsocideas!", "source": "#gsoc"}
{"id": 127, "text": "melta101: hello,\ni would like share one of my ideas\nbut the link shows invalid", "source": "#gsoc"}
{"id": 128, "text": "anujdeshpande: @melta101  - https://old.beagleboard.org/gsocideas", "source": "#gsoc"}
{"id": 129, "text": "melta101: Thank you", "source": "#gsoc"}
{"id": 130, "text": "jkridner: @melta101 I didn't see a post from you.", "source": "#gsoc"}
{"id": 131, "text": "jkridner: I posted https://forum.beagleboard.org/t/low-latency-risc-v-i-o-cpu-core/37156", "source": "#gsoc"}
{"id": 132, "text": "dhruvag2000: https://blynk.io/blog/blynk-ncp-integrated-with-zephyr-rtos?utm_source=linkedin&utm_medium=smm&utm_campaign=features&utm_content=zephyr\n\n\n@lorforlinux  could this give way to blynk + BCF or Bplay kind of an integration?", "source": "#gsoc"}
{"id": 133, "text": "melta101: Hello @JKridner \ni have been going to the repo\ncould you suggest some ideas where I can contribute to improving the existing system\nI have worked with SDRs and also majorly worked on device driver development on multiple SBCs such as beaglebone Black", "source": "#gsoc"}
{"id": 134, "text": "melta101: i see amazing possibilities in beagle V Fire in SDR development", "source": "#gsoc"}
{"id": 135, "text": "melta101: a SDR solution for Beaglebone for at least sub Ghz as a starting point", "source": "#gsoc"}
{"id": 136, "text": "melta101: creating a solution to integrate GNUradio and beaglebone", "source": "#gsoc"}
{"id": 137, "text": "jkridner: I'd suggest targeting BeagleV-Fire.", "source": "#gsoc"}
{"id": 138, "text": "jkridner: There are some existing BeagleBone SDR capes that might be worth exploring. LimeSDR.", "source": "#gsoc"}
{"id": 139, "text": "jkridner: KiwiSDR", "source": "#gsoc"}
{"id": 140, "text": "melta101: during my time with SDR and gnu radio \nthere was no direct support for KiwiSDR and GNURadio\nluckily there are OE SDKs with GNU Radio for embedded devices", "source": "#gsoc"}
{"id": 141, "text": "melta101: and having an FPGA in fire actually helps in parallel processing the IQ signals", "source": "#gsoc"}
{"id": 142, "text": "melta101: the problem i see is with the supply of kiwiSDR in my location", "source": "#gsoc"}
{"id": 143, "text": "melta101: https://forum.beagleboard.org/t/sdr-toolkit-integration-to-beaglebone/37177\ni am welcome to sugeestion as this is new to me.", "source": "#gsoc"}
{"id": 144, "text": "jkridner: @melta101 you put me as a mentor. would you not mentor?", "source": "#gsoc"}
{"id": 145, "text": "jkridner: I really hate discord.", "source": "#gsoc"}
{"id": 146, "text": "jkridner: is there no way to get public logs of channels?", "source": "#gsoc"}
{"id": 147, "text": "melta101: There should be an option \"moderator log\"", "source": "#gsoc"}
{"id": 149, "text": "melta101: As I am relatively new to to open source contribution\nI'll wouldn't think being a mentor would be a good idea\n\nBut I do want to get kick off this project\nI do have a general layout on how to proceed", "source": "#gsoc"}
{"id": 150, "text": "jkridner: I see \"audit log\", but not a general channel chat log.", "source": "#gsoc"}
{"id": 151, "text": "dhruvag2000: @JKridner iiuc you want something like our IRC chat logs but for discord?", "source": "#gsoc"}
{"id": 152, "text": "dhruvag2000: Somewhere externally hosted logs that any non discord user can just go and read passively?", "source": "#gsoc"}
{"id": 153, "text": "jkridner: yes!", "source": "#gsoc"}
{"id": 154, "text": "jkridner: at least for this channel.", "source": "#gsoc"}
{"id": 155, "text": "melta101: https://discord.com/developers/docs/resources/audit-log#:~:text=Viewing%20audit%20logs%20requires%20the,are%20stored%20for%2045%20days.", "source": "#gsoc"}
{"id": 156, "text": "melta101: Audit log has param to add set of users", "source": "#gsoc"}
{"id": 157, "text": "dhruvag2000: I find some browser extensions and stuff for this\nhttps://chrome.google.com/webstore/detail/discord-chat-exporter-bac/lljknccjfgeihgdboidlkoofdknieffm\n\nBut idk how to push to some online server @JKridner", "source": "#gsoc"}
{"id": 158, "text": "jkridner: 😦", "source": "#gsoc"}
{"id": 159, "text": "jkridner: I hate discord", "source": "#gsoc"}
{"id": 160, "text": "jkridner: Almost as much as I hate slack.", "source": "#gsoc"}
{"id": 163, "text": "jkridner: I'm nearing burnout for the day already. Trying to get the GSoC stuff setup is a nightmare and I seem to have no help.", "source": "#gsoc"}
{"id": 164, "text": "melta101: If there is anything I can help\nI can offer you any help", "source": "#gsoc"}
{"id": 165, "text": "jkridner: @lorforlinux can I get updates to https://forum.beagleboard.org/t/gsoc-ideas/35850#general-requirements-5 for a Zephyr-based requirement?", "source": "#gsoc"}
{"id": 166, "text": "jkridner: @melta101 please review all the info I post and let me know if there are confusing gaps.", "source": "#gsoc"}
{"id": 169, "text": "melta101: @JKridner could you pin the proposal template\nrest all seems fine", "source": "#gsoc"}
{"id": 174, "text": "jkridner: @lorforlinux are you working on this today. I really want to put our application in.", "source": "#gsoc"}
{"id": 177, "text": "andrearosetti: Hello, I am a 3rd year electronic engineering student at Politecnico di Milano, Italy. I would like to participate to GSoC 2024. I don't know if I have the skills needed for it but I want to give it a try. How do I get started?", "source": "#gsoc"}
{"id": 178, "text": "dhruvag2000: https://buff.ly/3SA0puF\n\nWondering how much effort this would be on beagleplay or something?", "source": "#gsoc"}
{"id": 180, "text": "andrearosetti: Hi, can I contact you to have information on how to prepare for GSoC?", "source": "#gsoc"}
{"id": 181, "text": "jkridner: This is where we connect! What questions do you have? Please don’t reach out privately—that isn’t how this works. We engage as a community. Feel free to mention me to get my attention.", "source": "#gsoc"}
{"id": 182, "text": "jkridner: @lorforlinux this connection doesn’t seem as easy for ideas on gsoc.beagleboard.io and those are out of date. I am fine to put proposals there, but let’s stick to moving the ideas to the forum. We can link and organize on gsoc.beagleboard.io, but they should live on the forum.", "source": "#gsoc"}
{"id": 183, "text": "andrearosetti: @JKridner thank you, I wasn't sure on how this works. Sorry for the following naive questions, I am a total beginner. So, I understand the first thing to do is looking for ideas on the forum, doing some research and trying to expand them into proposals. How do I know if they are not already being taken? Do they all require experience with Linux? In that case, what in particular?", "source": "#gsoc"}
{"id": 184, "text": "jkridner: no problem. i’ll just give frank answers. total beginners welcome.", "source": "#gsoc"}
{"id": 185, "text": "jkridner: doesn’t matter if an idea is taken. what matters is how you connect with that idea. selection is based on proposal quality and community engagement.", "source": "#gsoc"}
{"id": 186, "text": "jkridner: Preexisting experience with Linux is not required, but likely needs to be developed.", "source": "#gsoc"}
{"id": 187, "text": "lorforlinux: For sure, gsoc site has no way to chat thus forum is the best place for all the discussion.", "source": "#gsoc"}
{"id": 188, "text": "lorforlinux: @JKridner Sorry missed your message. did you submit our application?", "source": "#gsoc"}
{"id": 189, "text": "lorforlinux: @here New GSoC site: https://gsoc.beagleboard.io/", "source": "#gsoc"}
{"id": 190, "text": "lorforlinux: We will be sharing a proposal template and guide to easily create a proposal on the new site. For discussion on ideas please visit https://forum.beagleboard.org/", "source": "#gsoc"}
{"id": 191, "text": "ayush1325: Looks amazing. Really liking the new theme.", "source": "#gsoc"}
{"id": 193, "text": "jkridner: oops, wrong channel.", "source": "#gsoc"}
{"id": 194, "text": "melta101: @lorforlinux we could add a list of mentors with their discord or forum nametag in the new site", "source": "#gsoc"}
{"id": 195, "text": "dhruvag2000: Indeed I do too", "source": "#gsoc"}
{"id": 197, "text": "gagana0385: yes please, that would be helpful. I am very much interested in one of the project ( RISC-V Based PRU on FPGA) and want to get in touch with the mentors for more guidance.", "source": "#gsoc"}
